<script setup>
const img = ref('./img/about-img.png');
</script>
<template>
  <section class="about" id="about">
    <div class="container">
      <div class="about__head">
        <h2><span>О проекте</span> <br>«Счастливые люди России»</h2>
        <p>Этот проект — не просто подборка видео. Это живая летопись добрых событий, чудес и перемен, которые
          происходят прямо сейчас среди нас.</p>
      </div>
      <div class="about__content">
        <div class="about__img">
          <img :src="img" alt="">
        </div>
        <div class="about__right">
          <div class="about__adv">
            <div class="about__adv-item">
              <div class="icon">
                <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M39.6004 22.0004C39.6004 17.3326 37.7461 12.856 34.4455 9.55531C31.1448 6.25467 26.6682 4.40039 22.0004 4.40039C17.3326 4.40039 12.856 6.25467 9.55531 9.55531C6.25467 12.856 4.40039 17.3326 4.40039 22.0004L4.41579 22.7616L4.47299 23.602C4.67446 25.8153 5.2933 27.9704 6.29679 29.9534L6.43539 30.2174L4.43339 38.2342L4.40259 38.4168V38.5972C4.41656 38.7557 4.46476 38.9093 4.54387 39.0474C4.62297 39.1855 4.73108 39.3047 4.86076 39.397C4.99043 39.4892 5.13858 39.5522 5.29496 39.5816C5.45135 39.6111 5.61226 39.6062 5.76659 39.5674L13.7856 37.5654L14.0496 37.7062C16.7331 39.065 19.7201 39.7134 22.7255 39.5895C25.7309 39.4656 28.6544 38.5734 31.2169 36.9983C33.7795 35.4231 35.8956 33.2175 37.3632 30.5919C38.8308 27.9663 39.6011 25.0083 39.6004 22.0004ZM13.2004 17.6004C13.2004 17.0169 13.4322 16.4573 13.8448 16.0448C14.2573 15.6322 14.8169 15.4004 15.4004 15.4004H22.0004C22.5839 15.4004 23.1434 15.6322 23.556 16.0448C23.9686 16.4573 24.2004 17.0169 24.2004 17.6004V26.4004C24.2004 26.9839 23.9686 27.5434 23.556 27.956C23.1434 28.3686 22.5839 28.6004 22.0004 28.6004H15.4004C14.8169 28.6004 14.2573 28.3686 13.8448 27.956C13.4322 27.5434 13.2004 26.9839 13.2004 26.4004V17.6004ZM28.9216 17.2792C29.0753 17.1251 29.2713 17.0201 29.4847 16.9774C29.6981 16.9347 29.9194 16.9563 30.1206 17.0394C30.3217 17.1226 30.4937 17.2635 30.6147 17.4445C30.7357 17.6254 30.8003 17.8381 30.8004 18.0558V25.945C30.8003 26.1626 30.7357 26.3754 30.6147 26.5563C30.4937 26.7372 30.3217 26.8782 30.1206 26.9613C29.9194 27.0445 29.6981 27.0661 29.4847 27.0234C29.2713 26.9807 29.0753 26.8757 28.9216 26.7216L26.4004 24.2004V19.8004L28.9216 17.2792Z"
                    fill="#91AA00" />
                  <path
                    d="M28.9216 17.2792C29.0753 17.1251 29.2713 17.0201 29.4847 16.9774C29.6981 16.9347 29.9194 16.9563 30.1206 17.0394C30.3217 17.1226 30.4937 17.2635 30.6147 17.4445C30.7357 17.6254 30.8003 17.8381 30.8004 18.0558V25.945C30.8003 26.1626 30.7357 26.3754 30.6147 26.5563C30.4937 26.7372 30.3217 26.8782 30.1206 26.9613C29.9194 27.0445 29.6981 27.0661 29.4847 27.0234C29.2713 26.9807 29.0753 26.8757 28.9216 26.7216L26.4004 24.2004V19.8004L28.9216 17.2792Z"
                    fill="white" />
                  <path
                    d="M13.2004 17.6004C13.2004 17.0169 13.4322 16.4573 13.8448 16.0448C14.2573 15.6322 14.8169 15.4004 15.4004 15.4004H22.0004C22.5839 15.4004 23.1434 15.6322 23.556 16.0448C23.9686 16.4573 24.2004 17.0169 24.2004 17.6004V26.4004C24.2004 26.9839 23.9686 27.5434 23.556 27.956C23.1434 28.3686 22.5839 28.6004 22.0004 28.6004H15.4004C14.8169 28.6004 14.2573 28.3686 13.8448 27.956C13.4322 27.5434 13.2004 26.9839 13.2004 26.4004V17.6004Z"
                    fill="white" />
                </svg>
              </div>
              <div class="n">90+</div>
              <p>Видеоисторий</p>
            </div>
            <div class="about__adv-item">
              <div class="icon">
                <svg width="46" height="46" viewBox="0 0 46 46" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M10.987 8.20768C14.1892 5.11204 18.5047 3.3787 22.9993 3.38282C27.5008 3.38282 31.822 5.11518 35.0116 8.20768C37.8999 11.0044 39.4045 14.1351 39.8021 17.3866C40.1978 20.6099 39.4906 23.8452 38.1417 26.8794C35.4646 32.9155 30.1431 38.4043 25.0389 41.9757C24.444 42.3935 23.7308 42.6181 22.9993 42.6181C22.2678 42.6181 21.5546 42.3935 20.9596 41.9757C15.8554 38.4043 10.534 32.9135 7.85477 26.8794C6.50799 23.8452 5.80284 20.6099 6.19641 17.3846C6.59409 14.1351 8.0987 11.0064 10.987 8.20768ZM17.3621 18.9761C17.3621 17.5086 17.956 16.1013 19.0132 15.0636C20.0704 14.026 21.5042 13.443 22.9993 13.443C24.4944 13.443 25.9282 14.026 26.9854 15.0636C28.0425 16.1013 28.6364 17.5086 28.6364 18.9761C28.6364 20.4436 28.0425 21.8509 26.9854 22.8886C25.9282 23.9263 24.4944 24.5092 22.9993 24.5092C21.5042 24.5092 20.0704 23.9263 19.0132 22.8886C17.956 21.8509 17.3621 20.4436 17.3621 18.9761Z"
                    fill="#2E6CF0" />
                  <path
                    d="M22.9999 10.1475C21.1268 10.1475 19.2957 10.7029 17.7383 11.7435C16.1809 12.7842 14.967 14.2633 14.2502 15.9938C13.5334 17.7243 13.3459 19.6286 13.7113 21.4657C14.0767 23.3028 14.9787 24.9903 16.3032 26.3148C17.6277 27.6392 19.3152 28.5412 21.1523 28.9067C22.9894 29.2721 24.8936 29.0845 26.6241 28.3677C28.3546 27.6509 29.8337 26.437 30.8744 24.8796C31.915 23.3222 32.4705 21.4911 32.4705 19.618C32.4705 17.1063 31.4727 14.6974 29.6966 12.9213C27.9205 11.1453 25.5116 10.1475 22.9999 10.1475ZM26.4666 16.2149C26.707 16.2146 26.9421 16.2857 27.1421 16.4191C27.3421 16.5525 27.498 16.7423 27.5901 16.9643C27.6822 17.1864 27.7064 17.4308 27.6596 17.6666C27.6127 17.9024 27.497 18.119 27.327 18.289C27.157 18.459 26.9404 18.5747 26.7046 18.6215C26.4688 18.6684 26.2244 18.6442 26.0023 18.5521C25.7803 18.46 25.5905 18.3041 25.4571 18.1041C25.3237 17.9041 25.2526 17.669 25.2529 17.4286C25.2529 17.1067 25.3808 16.798 25.6084 16.5704C25.836 16.3427 26.1447 16.2149 26.4666 16.2149ZM19.5332 16.2149C19.7736 16.2146 20.0086 16.2857 20.2086 16.4191C20.4086 16.5525 20.5645 16.7423 20.6567 16.9643C20.7488 17.1864 20.7729 17.4308 20.7261 17.6666C20.6793 17.9024 20.5635 18.119 20.3935 18.289C20.2235 18.459 20.0069 18.5747 19.7711 18.6215C19.5353 18.6684 19.2909 18.6442 19.0689 18.5521C18.8468 18.46 18.6571 18.3041 18.5237 18.1041C18.3903 17.9041 18.3192 17.669 18.3194 17.4286C18.3198 17.1068 18.4477 16.7983 18.6753 16.5707C18.9028 16.3432 19.2114 16.2152 19.5332 16.2149ZM28.3333 22.033C27.9358 24.3022 25.699 25.8761 22.9999 25.8761C20.3008 25.8761 18.0652 24.3022 17.6677 22.033C17.6634 22.01 17.6609 21.9867 17.6602 21.9633C17.6602 21.6355 18.059 21.4237 18.4079 21.5433C19.7537 22.0081 21.3238 22.2449 23.0011 22.2449C24.6784 22.2449 26.2485 22.0081 27.5944 21.5433C27.942 21.4187 28.342 21.6343 28.342 21.9633C28.3409 21.9867 28.338 22.01 28.3333 22.033Z"
                    fill="white" />
                </svg>
              </div>
              <div class="n">85</div>
              <p>Регионов России</p>
            </div>
            <div class="about__adv-item">
              <div class="icon">
                <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M25.5 6.75C22.35 6.75 19.575 8.325 18 10.8C16.425 8.325 13.65 6.75 10.5 6.75C5.55 6.75 1.5 10.8 1.5 15.75C1.5 24.675 18 33.75 18 33.75C18 33.75 34.5 24.75 34.5 15.75C34.5 10.8 30.45 6.75 25.5 6.75Z"
                    fill="#E44236" />
                </svg>
              </div>
              <div class="n">1М+</div>
              <p>Просмотров</p>
            </div>
          </div>
          <div class="about__text">
            <h3>Наша миссия</h3>
            <p>Мы верим, что счастье — это не привилегия избранных, а естественное состояние человека. Наша цель —
              показать, что радость, надежда и вдохновение можно найти в каждом уголке нашей огромной страны.
            </p>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>
<style lang="sass" scoped>
.about
  margin-top: 87px
  padding-top: 64px
  padding-bottom: 198px
  position: relative
  background: #fff
  &-page 
    padding-top: 150px
    margin-top: 0
    .about__img 
      top: 370px
  &__head 
    display: flex
    flex-direction: column
    gap: 30px
    text-align: center
    align-items: center
    margin-bottom: 79px
    h2 
      span 
        color: #AAB1B5
    p 
      max-width: 738px
  &__content 
    display: flex
    justify-content: flex-end
  &__right 
    max-width: 673px
    width: 100%
    display: flex
    flex-direction: column
    gap: 82px
  &__adv 
    display: flex
    gap: 55px
    align-items: flex-start
    &-item 
      text-align: center
      display: flex
      align-items: center
      flex-direction: column
      &:first-child
        .icon 
          background: #E5EAC2
      &:last-child
        .icon 
          background: #F8E1DD
      .icon 
        width: 80px
        height: 80px
        display: flex
        align-items: center
        justify-content: center
        border-radius: 50%
        background: #C8D8FA
        margin-bottom: 10px
      .n 
        font-size: 20px
        line-height: 1
        color: #2E363B
        font-weight: 600
        margin-bottom: 6px
      p 
        font-size: 16px
        line-height: 1
        font-weight: 500
        color: #838383
  &__text 
    display: flex
    flex-direction: column
    gap: 25px
    width: 100%
    h3 
      color: #2e6cf0
      font-size: 36px
      line-height: 135%
      font-weight: 600
    p 
      color: #585858
  &__img 
    position: absolute
    left: 0
    top: 290px
@media (max-width: 1800px)
  .about__img 
    left: -200px
@media (max-width: 1400px)
  .about__img
    top: 260px
    
  .about__right 
    max-width: 500px
@media (max-width: 1200px)
  .about__head 
    margin-bottom: 62%
  .about-page 
    .about__img 
      top: 300px
  .about__img 
    left: 0
    width: 98%
    img 
      width: 100%
  .about__right 
    max-width: 100%
  .about__adv 
    justify-content: center
@media (max-width: 767px)
  .about 
    margin-top: 80px
    padding-top: 48px
    padding-bottom: 80px
    &-page 
      margin-top: 0
      padding-top: 128px
      .about__img 
        top: 270px
    &__head 
      gap: 16px
      margin-bottom: 70%
    &__img 
      top: 20%
      left: -20px
      width: 100%
    &__right 
      gap: 64px
    &__adv 
      gap: 16px
      &-item 
        .n 
          font-size: 14px
        p
          font-size: 12px
    &__text 
      gap: 16px
      h3
        font-size: 24px
@media (max-width: 540px)
  .about__img 
    top: 22%
  .about-page 
    .about__img 
      top: 320px
@media (max-width: 490px)
  .about__img 
    top: 26%
@media (max-width: 390px)
  .about__img 
    top: 28%
</style>